
public class Main {

	public static void main(String[] args) throws Exception {
		/*
		 * 예제를 보고 규칙을 유추한 뒤에 별을 찍어 보세요.
		 * 첫째 줄에 N이 주어진다. N은 항상 3×2k 수이다. (3, 6, 12, 24, 48, ...) (k ≤ 10)
		 * 첫째 줄부터 N번째 줄까지 별을 출력한다.
		 * 
		 * 24
		 * 
		 *                        *                        
		 *                       * *                       
		 *                      *****                      
		 *                     *     *                     
		 *                    * *   * *                    
		 *                   ***** *****                   
		 *                  *           *                  
		 *                 * *         * *                 
		 *                *****       *****                
		 *               *     *     *     *               
		 *              * *   * *   * *   * *              
		 *             ***** ***** ***** *****             
		 *            *                       *            
		 *           * *                     * *           
		 *          *****                   *****          
		 *         *     *                 *     *         
		 *        * *   * *               * *   * *        
		 *       ***** *****             ***** *****       
		 *      *           *           *           *      
		 *     * *         * *         * *         * *     
		 *    *****       *****       *****       *****    
		 *   *     *     *     *     *     *     *     *   
		 *  * *   * *   * *   * *   * *   * *   * *   * *  
		 * ***** ***** ***** ***** ***** ***** ***** *****	
		 */
		
		
	}
	
	private static void draw(int x, int y) {
		
	}
}
